shyndman/esp-theoretical-thermostat/sdkconfig.defaults
CONFIG_BSP_DISPLAY_BRIGHTNESS_LEDC_CH=1
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
CONFIG_BSP_DISPLAY_LVGL_FULL_REFRESH=y
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=3
CONFIG_BSP_LCD_MIPI_DSI_LANE_BITRATE_MBPS=1500
CONFIG_BSP_LCD_TYPE_720_1280_5_INCH_A=y
CONFIG_BSP_LCD_TYPE_800_1280_10_1_INCH=n
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_IDF_TARGET="esp32p4"
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_DRAW_BUF_ALIGN=64
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_LOG_LEVEL_INFO=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_MEM_SIZE_KILOBYTES=256
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_USE_OBSERVER=y
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM=y
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_RX_BA_WIN=32
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_TX_BA_WIN=32

# Screen burn-in protection
CONFIG_THEO_ANTIBURN_DURATION_SECONDS=30
CONFIG_THEO_ANTIBURN_SCHEDULE_START_MINUTE=240
CONFIG_THEO_ANTIBURN_SCHEDULE_STOP_MINUTE=241

# Backlight
CONFIG_THEO_BACKLIGHT_DAY_BRIGHTNESS_PERCENT=100
CONFIG_THEO_BACKLIGHT_NIGHT_BRIGHTNESS_PERCENT=70
CONFIG_THEO_BACKLIGHT_OVERNIGHT_END_MINUTES=390
CONFIG_THEO_BACKLIGHT_TIMEOUT_SECONDS=30

# Networking & MQTT
CONFIG_THEO_DNS_OVERRIDE_ADDR="192.168.84.3"
CONFIG_THEO_MQTT_HOST="dev-broker.local"
CONFIG_THEO_MQTT_PATH="/mqtt"
CONFIG_THEO_MQTT_PORT=9001
CONFIG_THEO_WIFI_STA_PASSWORD=""
CONFIG_THEO_WIFI_STA_SSID=""

# Time zone
CONFIG_THEO_TZ_STRING="EST5EDT,M3.2.0,M11.1.0"

# Audio Cues
CONFIG_THEO_BOOT_CHIME_ENABLE=y
CONFIG_THEO_BOOT_CHIME_VOLUME=70
CONFIG_THEO_BOOT_CHIME_QUIET_START_MINUTE=1380
CONFIG_THEO_BOOT_CHIME_QUIET_END_MINUTE=416

# Ensure we use the larger single-app partition so the factory slot fits LVGL builds
CONFIG_PARTITION_TABLE_SINGLE_APP=n
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_PARTITION_TABLE_TWO_OTA=n
CONFIG_PARTITION_TABLE_TWO_OTA_LARGE=n
CONFIG_PARTITION_TABLE_CUSTOM=n
